Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་རྒྱལ་བ་འཁོར་བ་འཇིག་གིས་བསྐོར། །ཇི་ལྟར་གསེར་ཐུབ་རྒྱལ་བས་བསྐོར་བ་དང་། །བདེ་གཤེགས་འོད་སྲུང་གིས་ཀྱང་བསྐོར་བ་ལྟར། །བཅོམ་ལྡན་འདས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར། །
en: “ ‘Blessed One, may you also turn the wheel of Dharma Just as the Victor Krakucchanda, The Victor Kanakamuni, And the Tathāgata Kāśyapa have done.

source: ཇི་ལྟར་སྤྲིན་གྱི་ཆུ་ཡིས་ཚིམ་བགྱིས་ཏེ། །
en: “ ‘Just as rainfall brings satisfaction

source: དེ་ཡིས་ལོ་ཐོག་སྨན་རྣམས་བསྐྱེད་པ་ལྟར། །
en: And causes medicinal plants to grow,

source: ཐུགས་རྗེའི་སྤྲིན་གྱིས་འཇིག་རྟེན་ཁྱབ་མཛད་དེ། །
en: So the clouds of your compassion encircle the world,

source: དེ་བཞིན་གཤེགས་པ་ཁྱོད་ཀྱིས་ཆོས་ཆར་ཕོབ། །
en: And you, Tathāgata, let the rain of Dharma fall!

source: རྣམ་པར་འདྲེན་མཆོག་གང་ཞིག་སྐྱེས་མ་ཐག །
en: “ ‘As soon as a supreme guide is born,

source: འགྲོ་བ་ཐར་བར་མཛད་སླད་སྒྲ་ཕྱུང་བ། །
en: He issues a sound in order to liberate beings.

source: དེང་དུས་དེང་ལགས་ལྷ་མི་སྐོམ་པ་རྣམས། །ཆོས་ཆེན་ཆུ་ཡིས་སྐོམ་པ་བསལ་དུ་གསོལ། །
en: Right now, please relieve the thirst of the yearning gods and humans With the water of great Dharma.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཚངས་པ་གཙུག་ཕུད་ཅན་གྱིས་གསོལ་བ་བཏབ་པར་མཁྱེན་ནས་ཉིད་ཀྱིས་ཐུགས་རྗེ་ཆེན་པོ་མ་བཏང་བས་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་དྲང་སྲོང་ལྷུང་བ་རི་དགས་ཀྱི་ནགས་སུ་དགེ་སྦྱོང་དང་། བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། གང་གིས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ་བསྐོར་ཏེདེར་མི་རྟག་པའི་སྒྲས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གོ་བར་བྱས་སོ། །
en: “Son of noble family, the Tathāgata, aware of Top-Knotted Brahmā’s supplication, proceeded with unrelinquishing great compassion to turn the unsurpassed Dharma wheel in Deer Park in Rṣipatana near the town of Vārāṇasī. In this world such a Dharma wheel had never been turned in conformity with the Dharma before by any wandering ascetic, brahmin, god, demon, or Brahmā himself. It was then that the word impermanence was understood throughout the entire billionfold universe.

source: ཀཽཎྜི་ནྱས་ཀྱང་ཐོག་མར་ཆོས་ཀུན་དུ་ཤེས་སོ། །
en: Kauṇḍinya was the first to fully know the Dharma.

source: དེ་ནས་དེའི་ཚེ་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ། །
en: Then the Buddha, inspired, uttered the following:

source: བརྗོད་དུ་མེད་ཅིང་ཟབ་པ་སྟེ། །ཡི་གེ་མེད་ཅིང་ངེས་པའི་དོན། །ཀཽཎྜི་ནྱས་ནི་འདི་ཤེས་པས། །
en: “ ‘That which is ineffable and profound, Beyond words and of definitive meaning— Kauṇḍinya understood it,

source: ང་ཡི་འབད་པ་དོན་མེད་མིན། །
en: So my effort has not been in vain!’

source: དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བཏུལ་བར་གྱུར་ཏོ། །
en: “By turning the wheel of the Dharma, the Tathāgata tamed innumerable and unfathomably many sentient beings.

source: དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོས་རྣམ་པར་རོལ་པར་རིག་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་གིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: Through knowing this magical play of great tathāgata compassion, immeasurable and innumerable sentient beings generated the thought of awakening.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་རྣམ་པ་བཅུ་དྲུག་པོ་འདི་ནི་ལྷུན་གྱིས་གྲུབ་པར་རྟག་ཏུ་འཇུག་པ་སྟེ་ཡང་གཏང་བར་བྱ་བ་མ་ཡིན་ནོ། །
en: “Son of noble family, these sixteen kinds of great compassion of the blessed buddhas are constantly spontaneously active and are never given up.

source: ཐུགས་རྗེ་ཆེན་པོ་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་རེ་རེའི་ཆེད་དུ་ཡང་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་སུ་གནས་པར་སྤྲོ་སྟེ།
en: Endowed with such great compassion, tathāgatas happily dwell among the denizens in the great hell realms for the sake of each and every being, for as many eons as there are grains of sand in the river Ganges.

source: གལ་ཏེ་སེམས་ཅན་དེ་དག་འཕགས་པའི་ཆོས་འདུལ་བ་ལ་འདུལ་བར་འགྱུར་བ་ལྟ་ན་དེ་བཞིན་གཤེགས་པ་ཡང་ཡོངས་སུ་མི་སྐྱོ་ཞིང་། ཐུགས་རྗེ་ཆེན་པོ་དེ་ཡང་ཡོངས་སུ་མི་མཉམ་མོ། །
en: When they gaze at those to be tamed through the superior Dharma and Vinaya, the tathāgatas are never discouraged, and their great compassion never deteriorates.

source: དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་འཇུག་གོ། །
en: That is how the inconceivable great compassion of the blessed buddhas extends to sentient beings.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་པགས་པའི་རྣམ་པ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་ཤའི་རྣམ་པ་ལྟ་བུའོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་ནི་རུས་པ་དང་རྐང་གི་རྣམ་པ་ལྟ་བུའོ། །
en: “The compassion of śrāvakas and pratyekabuddhas is compared to skin, the compassion of bodhisattvas to flesh, and the great compassion of blessed buddhas to bones and marrow.

source: ཉན་ཐོས་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་རྗེས་སུ་ཡི་རང་བའོ། །
en: Śrāvaka compassion rejoices in buddha wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་འཇུག་པའོ། །
en: Bodhisattva compassion establishes bodhicitta.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་ནི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་བྱེད་པའོ། །
en: The great compassion of blessed buddhas predicts beings to awakening.

source: ཉན་ཐོས་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་བྱམས་པ་ལ་ལྟོས་པའོ། །
en: The compassion of śrāvakas relies on love.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ལ་ལྟོས་པའོ། །
en: The compassion of bodhisattvas relies on bringing beings to maturity.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་ནི་ཤིན་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ལྟོས་པའོ། །
en: The great compassion of blessed buddhas relies on bringing them to full maturity.

source: ཉན་ཐོས་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ནི་རྩོམ་པས་ཡོངས་སུ་སྐྱོ་བའོ། །
en: “The compassion of śrāvakas is discouraged by effort.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ནི་རྩོམ་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའོ། །
en: The compassion of bodhisattvas brings undertakings to completion.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་ནི་རྩོམ་པ་ཐམས་ཅད་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའོ། །
en: The compassion of blessed buddhas brings success in all undertakings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་ནི་མཆོག་ཡིན་ཏེ། གང་གི་ཕྱིར་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་ཆེད་དུ་བསྐལ་པའམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་དུ་གནས་ཀྱང་དེ་སྲིད་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ། །
en: “Therefore, son of noble family, the great compassion of the blessed buddhas is supreme because buddhas dwell for eons, hundreds of eons, thousands of eons, or hundreds of thousands of eons in order to tame beings. For so long as they do, they do not pass away into nirvāṇa.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱའོ། །
en: Son of noble family, you should understand this through this discourse.

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན། དྲི་མཆོག་གི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་དྲི་ལྡན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཙན་དན་ཁྱིམ་ཞེས་བྱ་བ་
en: “Son of noble family, in the past, innumerable beyond countless eons ago, in an eon known as Most Fragrant, in a world realm known as Fragrant, there appeared a tathāgata, an arhat, a completely and perfectly awakened buddha known as Sandalwood Dwelling.

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: He was endowed with perfect knowledge and perfect conduct, a sugata, a world knower, an unsurpassed charioteer of those to be tamed, a teacher of gods and humans, a buddha, a blessed one.

source: བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕྲག་བཅུ་དྲུག་ཐུབ་པར་གྱུར་ཏོ། །
en: The lifespan of the Blessed Tathāgata Sandalwood Dwelling reached sixteen times eighty-four thousand years.

source: དེའི་ཉན་ཐོས་ཀྱི་འདུས་པ་ནི་ཉན་ཐོས་བརྒྱད་ཅུ་རྩ་བཞི་ཕྲག་བཅུ་དྲུག་གོ། །
en: His śrāvaka entourage consisted of sixteen times eighty-four thousand śrāvakas.

source: བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེའི་སྤུའི་ཁུང་བུ་གཅིག་ནས་དྲིའི་ངད་བྱུང་བ་གང་ཡིན་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དྲི་ཞིམ་པོའི་དྲིར་བྱེད་དོ། །
en: “The sweet fragrance coming from one of the pores of his skin suffused the billionfold universe with sweet-smelling fragrance.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་དྲི་ང་བ་འབྱུང་བ་མེད་དོ། །
en: No foul smell arose in that world.

source: ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རྩིག་པ་དང་། ཤིང་དང་། རི་དང་། གཟུགས་སྣང་བ་རྣམས་དེ་བཞིན་གཤེགས་པའི་དྲི་དེས་ཡོངས་སུ་བསྒོས་པར་གྱུར་ཏེ།
en: In that world, furthermore, the fences, trees, mountains, and material forms that appeared were enveloped in the fragrance of that tathāgata.

source: དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་དྲི་ལྡན་ཞེས་བྱའོ། །
en: That is how it became known as Fragrant.

source: སེམས་ཅན་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་དྲི་དེས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྤྱོད་པ་ཁ་ན་མ་ཐོ་བ་མེད་པར་གྱུར་ཏོ། །
en: “Through the fragrance of the Tathāgata, despicable physical, verbal, and mental actions disappeared from the beings born in that realm.

source: སེམས་ཅན་གང་དག་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བ་དེ་དག་ཀྱང་། དྲི་དེ་བསྣམས་པས་བསམ་གཏན་བཞི་དག་བསྐྱེད་པར་གྱུར་ཏོ། །
en: When they smelled that fragrance, those who went forth into the religious life following the Dharma of that blessed one generated the four concentrations.

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་ཅིག་ཆར་བྱུང་བར་གྱུར་ཏེ། ཐམས་ཅད་ཀྱང་འདི་ལྟར་ཙན་དན་ཁྱིམ་ཞེས་བྱ་བར་མིང་འཐུན་པར་གྱུར་ཏོ། །
en: In that realm, ten thousand buddhas emerged simultaneously, all of them named Sandalwood Dwelling.

source: དེས་ན་བསྐལ་པ་དེ་དྲི་མཆོག་ཅེས་བྱའོ། །
en: That is how the eon came to be called Most Fragrant.

source: བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དུས་ཀྱི་ཚེ་སེམས་ཅན་སངས་རྒྱས་ཀྱིས་འདུལ་བ་གང་ཞིག་ངས་གདུལ་བར་བྱ་ཞེས་
en: “The Blessed Tathāgata Sandalwood Dwelling performed his buddha activity, and at the time of passing into nirvāṇa he beheld the disposition of a being who was trainable by a buddha and who was known as Trainable by Me.

source: སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་གཟིགས་ནདེས་ལྷའི་སྤྱན་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་ལྷའི་ནང་ན་སེམས་ཅན་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྒྱ་ཆེན་པོ་ལ་མོས་པ། སངས་རྒྱས་ཀྱིས་འདུལ་བ་གཅིག་ཅིག་དེར་བསྐལ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིར་གནས་ནས
en: The buddha saw with pure divine vision surpassing human sight that this one being among the gods in the Sphere of neither Perception nor Nonperception who had previously cultivated roots of virtue, who was devoted to the vast, and who was tamable by a buddha would remain there for eighty-four thousand eons.

source: དེ་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་ཞིང་། གལ་ཏེ་འདོད་པ་རྣམས་ལ་མ་རྩེས་པར་ཐེག་པ་ཆེན་པོའི་བསྔགས་པ་ཐོས་པ་ལྟ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་འགྱུར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཞིག་གཟིགས་སོ། །
en: Once he died and was reborn as a human, if he heard praise of the Great Vehicle instead of enjoying sense desires, he would generate the thought of unsurpassed perfect awakening and become someone who would not be turned back from unsurpassed perfect awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེ་ཐབས་མཁས་པས་ཐུགས་རྗེ་ཆེན་པོ་མངོན་དུ་མཛད་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: “Then the Blessed Tathāgata Sandalwood Dwelling manifested great compassion through his skill in means and said to the monks,

source: དགེ་སློང་དག་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་ལ་བབ་ཀྱིས་དེང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ། །
en: ‘Monks! Since the time has come for me to pass into nirvāṇa, I will now pass into nirvāṇa.’

source: !དེ་ནས་བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པས་ཐུགས་རྗེ་ཆེན་པོ་ལ་ལྟ་བས་ཡོངས་སུ་སྐྱོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་བསྟན་ཏོ། །
en: Thereupon the Blessed Tathāgata Sandalwood Dwelling entered the absorption called indefatigable by seeing with great compassion and displayed passing into nirvāṇa.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་སྐུ་གདུང་ནི་རྒྱས་པར་གྱུར་ཏེ།
en: “After passing into nirvāṇa, his relics were distributed.

source: དེའི་དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕྲག་བརྒྱད་དུ་གནས་པར་གྱུར་ཏོ། །
en: His sacred Dharma remained for eight times eighty-four thousand years.

source: དེའི་དམ་པའི་ཆོས་གནས་པ་ཡང་སྐྱེ་བོ་མང་པོས་ཐོབ་པར་གྱུར་ཏེ། དེའི་དམ་པའི་ཆོས་ལྟར་བཅོས་པ་གང་ཡང་མེད་པར་གྱུར་ཏོ། །
en: While his sacred Dharma was present, moreover, many beings received it, and no counterfeit Dharma appeared.

source: བཅོམ་ལྡན་འདས་དེ་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པ་དང་། རྫུ་འཕྲུལ་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་བསྐལ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིར་སྐུ་མི་སྣང་བར་གནས་པར་གྱུར་ཏོ། །
en: Through the cultivation of the power of meditative absorption and miraculous blessing, that blessed one remained unmanifest for eighty-four thousand eons.

source: དེ་ལྟར་བསྐལ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་འདས་ནས་སེམས་ཅན་དེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ། མིའི་འཇིག་རྟེན་དུ་ཚོང་དཔོན་ཞིག་གི་རིགས་སུ་སྐྱེས་པར་གྱུར་ཏོ། །
en: “Thus, when eighty-four thousand eons had passed, that being among the gods in the Sphere of neither Perception nor Nonperception died and was reborn in the human realm in the family of a merchant.

source: ཁྱེའུ་དེ་གང་གི་ཚེ་ལོ་བརྒྱད་ལོན་པར་གྱུར་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེ་བསྐལ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་འདས་ནས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ།
en: When he reached the age of eight, the Blessed Tathāgata Sandalwood Dwelling rose from his absorption that had lasted eighty-four thousand eons.

source: ཁྱེའུ་དེའི་མདུན་དུ་སངས་རྒྱས་ཀྱི་ཁ་དོག་དང་། གཟུགས་ཀྱིས་བཞུགས་ནས་ཁྱེའུ་དེ་མ་གཏོགས་པར་གཞན་གང་གིས་ཀྱང་དེ་མ་མཐོང་སྟེ།
en: He came before the youth in the form of a buddha, invisible to everyone else except the youth.

source: དེས་ཅི་ནས་ཀྱང་ཁྱེའུ་དེ་སེམས་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟར་ཐེག་པ་ཆེན་པོ་འདི་ལས་བརྩམས་ཏེ་ཁྱེའུ་དེ་ལ་ཆོས་བསྟན་ཏོ། །
en: “This caused the youth to firmly make up his mind to generate the thought of unsurpassed perfect awakening and not be turned back from unsurpassed perfect awakening. The Buddha proceeded to teach the Dharma to the youth, beginning with the Great Vehicle.

source: འདོད་པའི་ཉེས་པའི་གཏམ་ཡང་ཡང་དག་པར་བཤད་དོ། །
en: He also delivered teachings about the faults of desire.

source: བཅོམ་ལྡན་འདས་དེས་དེ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་རིག་ནས་ལྷའི་བུ་དག་ཁྱེའུ་འདི་བསྐལ་པ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ
en: The Blessed One understood the perfect special intention of the youth and predicted that the youth would completely awaken to unsurpassed perfect awakening after seventy-two times one hundred thousand countless eons.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་ཅེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་ངོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: He would emerge in the world as the Tathāgata Supreme Precious One.

source: དེའི་ལུང་བསྟན་པ་དེ་ནི་ཁྱེའུ་དེ་མ་གཏོགས་པར་མིར་གྱུར་པ་གང་གིས་ཀྱང་མ་ཐོས་སོ། །
en: No human being but the youth himself heard this prophecy.

source: ལྷའི་བུ་སྣོད་དུ་གྱུར་པ་སྟོང་ཕྲག་བཅུ་གཉིས་ཀྱིས་དེའི་ལུང་བསྟན་པ་དེ་ཐོས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཏེ།
en: Twelve thousand gods who were worthy heard it and generated the thought of unsurpassed perfect awakening.

source: འདི་སྐད་དུ། གང་གི་ཚེ་བཅོམ་ལྡན་འདས་རིན་ཆེན་མཆོག་དེ་བཞིན་གཤེགས་པ་དེས་བྱང་ཆུབ་བརྙེས་པར་གྱུར་པ་དེའི་ཚེ་བདག་ཅག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་ཡང་བཏབ་བོ། །
en: They also made an aspiration prayer saying, ‘When the Blessed Tathāgata called Supreme Precious One finds awakening, may we be born in his buddhafield at that time!’

source: བཅོམ་ལྡན་འདས་དེས་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་དེ་ཁྱོད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: “In order for them all to be born into that buddhafield, the Blessed One predicted, ‘The Tathāgata Supreme Precious One will predict your unsurpassed perfect awakening!’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཙན་དན་ཁྱིམ་དེ་བཞིན་གཤེགས་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལུང་བསྟན་ནས་དེའི་འོག་ཏུ་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ། །དེའི་སྐུ་གདུང་ནི་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་གྱུར་ཏོ། །
en: Thereupon, the Blessed Tathāgata Sandalwood Dwelling, having prophesied those bodhisattvas, completely passed into nirvāṇa, and the gods honored his relics.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གང་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་མེད་པ་དེ་ལྟ་བུའི་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་ནོ། །
en: “Son of noble family, the blessed buddhas are endowed with such compassion, which does not exist on the level of the śrāvakas or pratyekabuddhas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་གཅོད་པ་དེ་ལྟར་གང་དག་སངས་རྒྱས་རྣམས་ལ་ཡོན་འབུལ་བ་དེ་དག་གིས་དགེ་བའི་རྩ་བ་དེ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་དེརྒྱུ་ཆུད་མི་ཟ་བའི་ཕྱིར་རོ། །
en: Son of noble family, just as the blessed buddhas do not interrupt the continuity of the lineage of the buddhas, likewise, the roots of virtue of those who offer to the buddhas will also be uninterrupted until they pass into nirvāṇa, because causes do not perish.”

source: དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་བསྟན་པ་འདི་བཤད་པ་ན་འཁོར་དེ་ལས་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་སུམ་ཆ་སྙེད་ཀྱིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: When he had delivered this discourse on great tathāgata compassion, among the assembly, as many beings as a third of the number of grains of sand in the river Ganges generated the thought of unsurpassed perfect awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་ཕྱེད་སྙེད་ཀྱིས་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As many bodhisattvas as half the number of grains of sand in the river Ganges attained willing acceptance.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་སྙེད་ཀྱིས་ནི་སྙིང་རྗེ་ཆེན་པོ་རྣམ་པ་བཅུ་དྲུག་ཐོབ་པར་གྱུར་ཏོ། །
en: And as many bodhisattvas as the number of grains of sand in the river Ganges attained the sixteen kinds of great compassion.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དབང་བསྐུར་བ་དང་ལྡན་པའི་ཆོས་ཀྱི་བཟོད་པ་ཡང་ཐོབ་པར་གྱུར་ཏོ། །
en: They also attained acceptance of reality, which was endowed with the empowerment of all the Buddha’s teachings.

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: At that time, all in the assembly who had heard this teaching became content, pleased, delighted, and overjoyed.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། ལྷ་དང་མིའི་མཆོད་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་དོ།། །།
en: Feeling joyful and happy, everyone hailed the Blessed One with the words “Very good!” and honored him with offerings both human and divine.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ལས་གང་ཞེ་ན།
en: At that point, the Blessed One said to Dhāraṇīśvara­rāja, “Son of noble family, you may ask, ‘What are the actions of the tathāgatas?’

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་ལས་ནི་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གོ། །སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: There are thirty-two tathāgata actions. What are these actions?

source: རིགས་ཀྱི་བུ་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡེ་ཤེས་བླ་ན་མེད་པས་གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (1) “Son of noble family, the tathāgatas know with their unsurpassed wisdom and in accordance with reality what is possible and what is impossible.

source: རིགས་ཀྱི་བུ་དེ་ལ་གནས་ནི་གང་། གནས་མ་ཡིན་པ་ནི་གང་ཞེ་ན།
en: You may ask, son of noble family, what is possible and what is impossible?

source: རིགས་ཀྱི་བུ་འདི་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ་དང་། སྡུག་པ་དང་། དགའ་བ་དང་། ཡིད་དུ་འོང་བར་འགྱུར་བ་
en: That the maturation of wrongful conduct of body, speech, and mind will be desirable, pleasant, delightful, or attractive is impossible.

source: འདི་ནི་གནས་མེད་དོ། །
en: This will not happen.

source: འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་པ་སྟེ། གང་ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ་དང་། སྡུག་པ་དང་། དགའ་བ་དང་། ཡིད་དུ་འོང་བར་འགྱུར་བ་
en: That the maturation of good conduct of body, speech, and mind will be desirable, pleasant, delightful, and attractive is possible.

source: འདི་ནི་གནས་ཡིན་ནོ། །
en: This will happen.

source: རིགས་ཀྱི་བུ་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་སེར་སྣས་ལོངས་སྤྱོད་ཆེན་པོ་མངོན་པར་འགྲུབ་པ་དང་། འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱིས་ལྷ་དང་མིར་སྐྱེ་བ་དང་། གནོད་སེམས་ཀྱིས་མཛེས་པར་འགྱུར་བ་དང་། ལེ་ལོས་མངོན་པར་རྟོགས་པ་འཐོབ་པ་དང་། །སེམས་རྣམ་པར་གཡེངས་པས་ངེས་པར་གྱུར་པ་ལ་འཇུག་པ་དང་། གང་འཆལ་པའི་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལེགས་པར་འཇོམས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ་དེ་
en: Son of noble family, that one will attain great wealth through greediness, be born as a god or human through flawed moral conduct, become beautiful through ill will, attain realization through laziness, reach certainty through mental distraction, or destroy the karmic traces through flawed insight is impossible.

source: ནི་གནས་མ་ཡིན་ནོ། །
en: This will not happen.

source: འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་པ་སྟེ། གང་སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོ་མངོན་པར་འགྲུབ་པ་དང་། ཚུལ་ཁྲིམས་ཀྱིས་ལྷ་དང་མིར་སྐྱེ་བ་དང་། བཟོད་པས་མཛེས་པར་འགྱུར་བ་དང་། བརྩོན་འགྲུས་ཀྱིས་མངོན་པར་རྟོགས་པ་འཐོབ་པ་དང་། བསམ་གཏན་གྱིས་ངེས་པར་གྱུར་པ་ལ་འཇུག་པ་དང་། གང་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ལེགས་པར་འཇོམས་པ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That one will attain great wealth through generosity, be born as a god or human through moral conduct, become beautiful through patience, attain realization through perseverance, reach certainty through concentration, and destroy all the karmic traces through insight is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་མཚམས་མེད་པ་བྱེད་པ་སེམས་གནས་པར་འགྱུར་བ་
en: “That the mind of someone who performs the acts of immediate retribution will be at ease is impossible.

source: གང་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པའི་སེམས་གནས་པར་འགྱུར་བ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That the mind of someone with pure moral conduct will be at ease is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་དམིགས་པ་ཅན་གྱིས་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འཐོབ་པར་འགྱུར་བ་
en: That one will attain willing acceptance while being involved with objective references is impossible.

source: དེ་ནི་གནས་མེད་དོ། །
en: This will not happen.

source: གང་སྟོང་པ་ཉིད་ལ་མོས་པས་བཟོད་པ་འཐོབ་པར་འགྱུར་བ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That one will attain acceptance through devotion to emptiness is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་འགྱོད་པ་ལ་རབ་ཏུ་གནས་པས་སེམས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་བ་
en: That the mind will become pliant while in a state of regret is impossible.

source: གང་ཀུན་ནས་ལྡང་བ་མེད་པའི་སེམས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་བ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That a mind free of agitation will become pliant is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་བུད་མེད་ཀྱི་ལུས་དེ་ཉིད་ཀྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའམ། བརྒྱ་བྱིན་ནམ། ཚངས་པའམ། སངས་རྒྱས་སུ་འཇིག་རྟེན་དུ་འབྱུང་བ་
en: That a universal monarch, Śakra, Brahmā, or a buddha will appear in the world in a female body is impossible.

source: འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དེ། གང་བུད་མེད་ཀྱི་ལུས་བརྗེས་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའམ། བརྒྱ་བྱིན་ནམ། ཚངས་པའམ། སངས་རྒྱས་སུ་འཇིག་རྟེན་དུ་འབྱུང་བ་
en: That someone will appear in the world as a universal monarch, Śakra, Brahmā, or a buddha after she has exchanged her female body is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མི་མཉམ་པས་རྒྱལ་སྲིད་བྱེད་པ་
en: That someone who is not equal to the universal monarch will govern a kingdom is impossible.
